# Panda

Panda is another powerful library in Python, we can think of panda as extremly powerful version of excel.

Source:Udemy.com

# Series

Series is very similar to numpy array.The factor which differanciate numpy array with panada series is the ability of panda in 
axis label and it can hold any arbitory phyton Object.
It maens we can index by label,insted of a just number location.

In [1]:
import numpy as np
import pandas as pd

# Creating a saries

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data, index= labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
Ser1 = pd.Series([1,2,3,5],['USA','GERMANY','ITALY','JAPAN'])

In [7]:
Ser2 = pd. Series([1,2,3,4],['USA','IRAN','MEXICO','ITALY'])

In [8]:
Ser1

USA        1
GERMANY    2
ITALY      3
JAPAN      5
dtype: int64

In [9]:
Ser2

USA       1
IRAN      2
MEXICO    3
ITALY     4
dtype: int64

In [10]:
Ser1['USA']

1

In [11]:
Ser1+Ser2

GERMANY    NaN
IRAN       NaN
ITALY      7.0
JAPAN      NaN
MEXICO     NaN
USA        2.0
dtype: float64

In [12]:
Ser2['ITALY']

4

# DataFrames

In [13]:
from numpy.random import randn

In [14]:
np.random.randn(1,100,20)

array([[[ 1.18243861,  1.08577649, -0.89047372, ..., -1.211023  ,
         -0.78391209, -0.14900414],
        [-1.46228997, -0.10495782, -0.09161816, ...,  0.82456701,
          0.94289708, -1.29189736],
        [-0.89567654,  0.44586071, -0.17971514, ..., -0.69487409,
          0.63795988,  0.18491206],
        ...,
        [ 1.09486728, -0.68929509,  0.87317513, ...,  1.25913935,
          0.84201291, -0.52120858],
        [ 0.68696315,  0.35279612,  1.21335502, ..., -0.40517581,
         -0.36868288,  0.18867109],
        [ 0.50651988,  0.0853044 , -0.03261542, ..., -1.28623198,
         -0.19915292, -0.77148543]]])

In [15]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
B -0.517203 -1.630158 -0.192326  0.636801
C  1.039703 -1.032967 -0.308353  0.742247
D -1.242602 -0.218816 -0.748190 -1.068351
E -0.107704  1.140892  0.474239 -0.157579

# Selection and Indexing

We can garab a data with selection and indexing method

In [17]:
df['Y']

A    0.399961
B   -0.192326
C   -0.308353
D   -0.748190
E    0.474239
Name: Y, dtype: float64

In [18]:
df['W']

A    0.054829
B   -0.517203
C    1.039703
D   -1.242602
E   -0.107704
Name: W, dtype: float64

In [19]:
df

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
B -0.517203 -1.630158 -0.192326  0.636801
C  1.039703 -1.032967 -0.308353  0.742247
D -1.242602 -0.218816 -0.748190 -1.068351
E -0.107704  1.140892  0.474239 -0.157579

In [20]:
df.loc['A']

W    0.054829
X    0.487246
Y    0.399961
Z   -1.563092
Name: A, dtype: float64

In [21]:
df['Y']['E']

0.4742391049099591

In [22]:
df['W']['A']

0.05482869873870813

In [23]:
df[['W','X']]

          W         X
A  0.054829  0.487246
B -0.517203 -1.630158
C  1.039703 -1.032967
D -1.242602 -0.218816
E -0.107704  1.140892

# Creating a new Column:

In [24]:
df['NEW'] = df['W']+df['X']

In [25]:
df

          W         X         Y         Z       NEW
A  0.054829  0.487246  0.399961 -1.563092  0.542075
B -0.517203 -1.630158 -0.192326  0.636801 -2.147361
C  1.039703 -1.032967 -0.308353  0.742247  0.006736
D -1.242602 -0.218816 -0.748190 -1.068351 -1.461418
E -0.107704  1.140892  0.474239 -0.157579  1.033188

# Drop a Column:

df.drop('NEW',axis=1)

In [26]:
df

          W         X         Y         Z       NEW
A  0.054829  0.487246  0.399961 -1.563092  0.542075
B -0.517203 -1.630158 -0.192326  0.636801 -2.147361
C  1.039703 -1.032967 -0.308353  0.742247  0.006736
D -1.242602 -0.218816 -0.748190 -1.068351 -1.461418
E -0.107704  1.140892  0.474239 -0.157579  1.033188

In [27]:
df.drop('NEW',axis=1,inplace=True)

In [28]:
df

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
B -0.517203 -1.630158 -0.192326  0.636801
C  1.039703 -1.032967 -0.308353  0.742247
D -1.242602 -0.218816 -0.748190 -1.068351
E -0.107704  1.140892  0.474239 -0.157579

In [29]:
df.drop('E',axis=0,inplace=True)

In [30]:
df

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
B -0.517203 -1.630158 -0.192326  0.636801
C  1.039703 -1.032967 -0.308353  0.742247
D -1.242602 -0.218816 -0.748190 -1.068351

# Slicing and indexing

In [31]:
df['W']

A    0.054829
B   -0.517203
C    1.039703
D   -1.242602
Name: W, dtype: float64

In [32]:
df['W']['A']

0.05482869873870813

In [33]:
df.loc['A','W']

0.05482869873870813

In [34]:
df['X']['C']

-1.0329673581988323

In [35]:
df.loc[['B','C'],['W','X']]

          W         X
B -0.517203 -1.630158
C  1.039703 -1.032967

In [36]:
df.loc['B','W']

-0.5172031511056494

In [37]:
df['W']['B']

-0.5172031511056494

In [38]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.054829  0.399961
B -0.517203 -0.192326

In [39]:
df

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
B -0.517203 -1.630158 -0.192326  0.636801
C  1.039703 -1.032967 -0.308353  0.742247
D -1.242602 -0.218816 -0.748190 -1.068351

# Conditional Selection

Conditinal selection can help us to grab data based on the condition that we have,this ability is same in numpy and panda

In [40]:
df[df>0]

          W         X         Y         Z
A  0.054829  0.487246  0.399961       NaN
B       NaN       NaN       NaN  0.636801
C  1.039703       NaN       NaN  0.742247
D       NaN       NaN       NaN       NaN

In [41]:
df

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
B -0.517203 -1.630158 -0.192326  0.636801
C  1.039703 -1.032967 -0.308353  0.742247
D -1.242602 -0.218816 -0.748190 -1.068351

In [42]:
df[df['W']>0]

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
C  1.039703 -1.032967 -0.308353  0.742247

In [43]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092

In [44]:
df>0

       W      X      Y      Z
A   True   True   True  False
B  False  False  False   True
C   True  False  False   True
D  False  False  False  False

In [45]:
df[df>0]

          W         X         Y         Z
A  0.054829  0.487246  0.399961       NaN
B       NaN       NaN       NaN  0.636801
C  1.039703       NaN       NaN  0.742247
D       NaN       NaN       NaN       NaN

In [46]:
df[df['W']>0]

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092
C  1.039703 -1.032967 -0.308353  0.742247

In [47]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  0.054829  0.487246  0.399961 -1.563092

In [48]:
df[df['Z']<0]['X']

A    0.487246
D   -0.218816
Name: X, dtype: float64

In [49]:
df[(df['W']>0) & (df['Z']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [50]:
df[df['W']>0]['X']

A    0.487246
C   -1.032967
Name: X, dtype: float64

In [51]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.487246  0.399961
C -1.032967 -0.308353

# More Index Details

In [52]:
df.reset_index(inplace=True)

In [53]:
df

  index         W         X         Y         Z
0     A  0.054829  0.487246  0.399961 -1.563092
1     B -0.517203 -1.630158 -0.192326  0.636801
2     C  1.039703 -1.032967 -0.308353  0.742247
3     D -1.242602 -0.218816 -0.748190 -1.068351

In [54]:
newind='CA NY OR CA'.split()

In [55]:
newind

['CA', 'NY', 'OR', 'CA']

In [56]:
df['States']=newind

In [57]:
df

  index         W         X         Y         Z States
0     A  0.054829  0.487246  0.399961 -1.563092     CA
1     B -0.517203 -1.630158 -0.192326  0.636801     NY
2     C  1.039703 -1.032967 -0.308353  0.742247     OR
3     D -1.242602 -0.218816 -0.748190 -1.068351     CA

In [58]:
df.set_index('States',inplace=True)

In [59]:
df.reset_index('States')

  States index         W         X         Y         Z
0     CA     A  0.054829  0.487246  0.399961 -1.563092
1     NY     B -0.517203 -1.630158 -0.192326  0.636801
2     OR     C  1.039703 -1.032967 -0.308353  0.742247
3     CA     D -1.242602 -0.218816 -0.748190 -1.068351

In [60]:
df

       index         W         X         Y         Z
States
CA         A  0.054829  0.487246  0.399961 -1.563092
NY         B -0.517203 -1.630158 -0.192326  0.636801
OR         C  1.039703 -1.032967 -0.308353  0.742247
CA         D -1.242602 -0.218816 -0.748190 -1.068351

# Multi-Index and Index Hierarchy

In [61]:
import numpy as np
import pandas as pd

In [62]:
from numpy.random import randn

In [63]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [64]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [65]:
df

             A         B
G1 1 -0.380688  0.290907
   2  0.577116 -0.192216
   3 -0.742465  0.053659
G2 1  0.240941  0.620452
   2  0.141072  0.108517
   3 -0.230609  0.090635

In [66]:
df.loc['G2'].loc[1]['A']

0.24094084473674487

In [67]:
df.loc['G1'].loc[2]['B']

-0.1922164666529588

In [68]:
df.index.names=['Groups','Nums']

In [69]:
df

                    A         B
Groups Nums
G1     1    -0.380688  0.290907
       2     0.577116 -0.192216
       3    -0.742465  0.053659
G2     1     0.240941  0.620452
       2     0.141072  0.108517
       3    -0.230609  0.090635

In [70]:
df.xs(1,level='Nums')

               A         B
Groups
G1     -0.380688  0.290907
G2      0.240941  0.620452

# Missing Data

We can use Panda library for finding missing data in data set

In [71]:
import numpy as np
import pandas as pd

In [72]:
from numpy.random import randn

In [73]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [74]:
df=pd.DataFrame(d)

In [75]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [76]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [77]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [78]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [79]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [80]:
import numpy as np
import pandas as pd

In [81]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [82]:
df = pd.DataFrame(d)

In [83]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [84]:
df.index.name='Group'

In [85]:
df

         A    B  C
Group
0      1.0  5.0  1
1      2.0  NaN  2
2      NaN  NaN  3

In [86]:
df.dropna()

         A    B  C
Group
0      1.0  5.0  1

In [87]:
df.dropna(axis=1)

       C
Group
0      1
1      2
2      3

In [88]:
df

         A    B  C
Group
0      1.0  5.0  1
1      2.0  NaN  2
2      NaN  NaN  3

In [89]:
df.dropna(thresh=2)

         A    B  C
Group
0      1.0  5.0  1
1      2.0  NaN  2

In [90]:
df

         A    B  C
Group
0      1.0  5.0  1
1      2.0  NaN  2
2      NaN  NaN  3

In [91]:
df.fillna(value='FILL VALUE')

                A           B  C
Group
0             1.0         5.0  1
1             2.0  FILL VALUE  2
2      FILL VALUE  FILL VALUE  3

In [92]:
df

         A    B  C
Group
0      1.0  5.0  1
1      2.0  NaN  2
2      NaN  NaN  3

In [93]:
df['A'].fillna(value=df['A'].mean())

Group
0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [94]:
df['B'].fillna(value=df['B'].mean())

Group
0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

# Pandas_Groupby

In [95]:
import numpy as np
import pandas as pd

In [96]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [97]:
df=pd.DataFrame(data)

In [98]:
df.groupby('Company')

In [99]:
bycomp=df.groupby('Company')

In [100]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [101]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [103]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [104]:
bycomp.sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [105]:
df.groupby('Company').std().loc['GOOG']

Sales    56.568542
Name: GOOG, dtype: float64

In [106]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [107]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [108]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [109]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [110]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [112]:
df.groupby('Company')

In [113]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [114]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [115]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [116]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Merging,Joining and Concatenating

In [117]:
import pandas as pd

In [118]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [119]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [120]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [121]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [122]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [123]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [124]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [125]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Marging:

In [126]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [127]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [128]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [129]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [130]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [131]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [132]:
left.join(right,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

# Operations:

In [133]:
import numpy as np
import pandas as pd

In [134]:
df= pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [137]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [138]:
len(df['col2'].unique())

3

In [139]:
df['col2'].nunique()

3

In [140]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [141]:
df[(df['col2']>2) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [142]:
def times2(x):
    return x*2

In [143]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [144]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [145]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [146]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [147]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [148]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [149]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [150]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [151]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [152]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [153]:
df=pd.DataFrame(data)

In [154]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# Data input and output

In [155]:
import pandas as pd

In [156]:
df=pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [157]:
df.to_csv('my output',index=False)

In [158]:
pd.read_csv('my output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [159]:
pd.read_excel('Excel_Sample.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15